class SuperStarModel {
  final String name;
  final String image;
  final String description;

  SuperStarModel({
    required this.name,
    this.image = "https://via.placeholder.com/140x100",
    this.description = "بدون شرح",
  });
}

List<SuperStarModel> superstars = [
  SuperStarModel(
    name: "کیت وینسلت",
    image:
        "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSmCpHIZqxRCO9RuuZfmnXDkiNmFIY8flN4Kw&usqp=CAU",
    description:
        "کیت وینسلت بازیگر بریتانیایی متولد اکتبر ۱۹۷۵ در شهر ردینگ است. او از کودکی به بازیگری علاقه داشت و فعالیت‌های هنری خود را از سال ۱۹۹۱ در تلویزیون انگلیس آغاز کرد. اولین فیلم وینسلت موجودات بهشتی ساخت سال ۱۹۹۴ بود. در سوابق هنری او افتخارات فراوانی به چشم می خورد که از میان آنها می توان به دریافت یک جایزه اسکار، یک جایزه امی ساعات پربیننده، چهارجایزه گلدن گلوب و یک جایزه گرمی اشاره کرد. کیت وینسلت تاکنون هفت بار نامزد دریافت جایزه اسکار شده است."
        "کیت وینسلت سابقه فعالیت در آثاری همچون یک دنیا آرامش، میر از ایست تاون، مشکی زیبا، پرنده سیاه، تعطیلات، استیو جابز، میلدر پیرس، شیوع، بر آب رفتگان، دره میمون، اقیانوس ها: سیاره آبی ما، ماری و گل جادوگر، تایتانیک، زیبایی پنهان، جوجه برفی: داستان یک پنگوئن، کد ۹۹۹ و زندگی دیوید گیل را در کارنامه هنری خود دارد. ",
  ),
  SuperStarModel(
      name: "نیکول کیدمن",
      image:
          "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7VwfipEd0tEAU2z2PiOePNAm73UeYXHTPCw&usqp=CAU",
      description:
          "نیکول کیدمن بازیگر و تهیه کننده استرالیایی آمریکایی متولد ۲۰ ژوئن ۱۹۶۷ در هاوایی است که در سال ۱۹۸۹ با بازی در فیلم سکوت مرگبار و سریال تلویزیونی بانگکوک هیلتون به اوج شهرت خود رسید."),
  SuperStarModel(
      name: "مایکل کیتون",
      image:
          "https://static.namava.ir/Content/Upload/Images/2bbf2489-7335-4ac3-a41b-ba6b99641a7e.jpg?anchor=middlecenter&crop=auto&scale=both&w=140&h=140",
      description:
          "مایکل کیتون بازیگر آمریکایی است که در ۵ سپتامبر ۱۹۵۱ در پنسیلوانیا به دنیا آمد. او از سال ۱۹۷۵ فعالیت هنری خود را آغاز کرد. مایکل کیتون تحصیلاتش را در دانشگاه ایالتی کنت گذراند. او با بازی در نقش بتمن در فیلم بتمن ۱۹۸۹ به شهرت رسید. "
          "مایکل کیتون تاکنون جوایز و افتخارات فراوانی کسب کرده است که از میان آنها می توان به جایزه گلدن گلوب بهترین بازیگر مرد در مینی سریال، نامزدی دریافت جایزه اسکار بهترین بازیگر نقش اصلی مرد، نامزدی دریافت جایزه بفتای بهترین بازیگری و جایزه بهترین بازیگر از سوی انجمن منتقدین فیلم بوستون اشاره کرد."
          "مایکل کیتون سابقه فعالیت در آثاری همچون ارزش، دوپسیک، جنون سرعت، محافظ، مینیون ها، محاکمه شیکاگو ۷، پلیس آهنی، افشاگر، بردمن، بیتل جوس، داستان اسباب بازی ۳، دامبو، بازگشت بتمن، بتمن و مرد عنکبوتی: بازگشت به خانه را در کارنامه هنری خود دارد."),
  SuperStarModel(name: "کیانو ریوز"),
  SuperStarModel(
    name: "کیانو ریوز",
    image:
        "https://static.namava.ir/Content/Upload/Images/c8191005-58c1-4872-aff2-134329a9a6cb.jpg?anchor=middlecenter&crop=auto&scale=both&w=140&h=140",
  ),
];
